Project Report 
Stock Wise - Retail Inventory Management System

Streamline Your Shop Operations

Submitted By: Vansh Rastogi
Registration number: 25BCE11364
Email: vansh.25bce11364@vitbhopal.ac.in
Subject : Problem Solving
Project Title:  Stock Wise - Inventory Management System for Small Retailers
Technology Stack : React, Node.js, Clerk Authentication, Google Gemini AI (for potential receipt scanning)
Date: November 2025

Table of Contents
1. Introduction
2. Problem Statement
3. Functional Requirements
4. Non-functional Requirements
5. System Architecture
6. Design Diagrams
7. Design Decisions & Rationale
8. Implementation Details
9. Screenshots / Results
10. Testing Approach
11. Challenges Faced
12. Learnings & Key Takeaways
13. Future Enhancements
14. References
Introduction

Stock Wise is a modern, user-friendly inventory management web application designed specifically for small retailers in India. The application provides a comprehensive solution for shop management by combining core inventory tracking with essential features like sales management, supplier tracking, and simple, actionable reports.

In the fast-paced retail environment, small shop owners often struggle to maintain accurate stock levels, track daily sales, and understand their business performance. Operations are frequently manual, relying on paper notepads or basic spreadsheets, leading to errors, stock-outs, overstocking, and lost sales opportunities. Stock Wise addresses this by providing a unified dashboard where retailers can manage all their shop operations in one place.

The application leverages a simple and intuitive interface that requires minimal technical knowledge. The target audience includes kirana store owners, small boutique managers, electronic repair shop owners, and anyone running a small retail business who needs better control over their inventory and sales.


Problem Statement

Managing inventory and sales effectively remains a significant challenge for most small retailers. The key problems this application addresses are:
Manual Stock Tracking: Retailers often use physical notepads or memory to track stock levels, which is error-prone and inefficient. This leads to situations where popular items are out-of-stock (stock-outs) or capital is tied up in unsold goods (overstocking).
Inefficient Sales Recording: Daily sales are recorded manually, making it difficult to track which items are selling fast, calculate daily profits, or identify sales trends. This process is time-consuming and susceptible to human error.
Lack of Real-Time Visibility: Without a digital system, retailers have no real-time view of their current stock levels or today's sales performance. This makes it impossible to make quick, informed decisions about reordering or promotions.
 
Difficulty in Supplier Management: Keeping track of supplier contact information, past orders, and amounts owed is often done in disparate places, making the reordering process cumbersome.
Tedious and Error-Prone Reporting: Generating simple reports like "Monthly Profit & Loss" or "Top-Selling Items" requires manual calculation, which is slow and often inaccurate. Retailers lack quick insights to understand their business health.
No Low-Stock Alerts: There is no automated system to warn the retailer when an item is running low, leading to frequent stock-outs and potential loss of customer goodwill.
Stock Wise solves these problems by providing an all-in-one inventory management platform with real-time stock tracking, streamlined sales entry, supplier management, automated low-stock alerts, and instant report generation.
3. Functional Requirements
3.1 User Authentication and Shop Setup
The system shall allow the shop owner to create an account using email and password. The system shall enforce secure authentication. The system shall allow the user to set up their shop profile (Shop Name, Address, Contact, GST Number). The system shall provide secure session management.
3.2 Dashboard and Business Overview
The system shall display total sales for the current day. The system shall display total sales for the current month. The system shall show the number of low-stock items requiring attention. The system shall show the top 5 selling products for the week. The system shall display a chart of daily sales for the past week. The system shall show a summary of recent sales activity.
3.3 Product & Inventory Management
The system shall allow users to add new products (Product Name, SKU, Category, Cost Price, Selling Price, Initial Stock Quantity, Supplier). The system shall allow users to view all products in a list. The system shall allow users to edit product details. The system shall allow users to delete products. The system shall automatically update stock levels when a sale is made. The system shall allow manual stock adjustment (e.g., for damaged goods or stock counts). The system shall display current stock levels for each product. The system shall automatically flag products as "Low Stock" when below a defined threshold.
 
Sales Management : The system shall allow users to create a new sale. The system shall  allow users to add multiple products to a single sale. The system shall automatically calculate the total bill amount. The system shall apply taxes (e.g., GST) if configured. The system shall update the inventory stock levels in real-time upon confirming a sale. The system shall generate a printable bill/receipt for the customer. The system shall record the date and time of each sale. The system shall view a history of all past sales.
Supplier Management : The system shall allow users to add supplier details (Supplier Name, Contact Person, Phone, Email, Address). The system shall allow users to view and edit supplier details. The system shall link products to their primary supplier. The system shall display a list of suppliers for easy access during reordering.
 Reports and Insights : The system shall generate a Sales Report for a selected date range. The system shall generate a Profit & Loss report (based on Sale Price - Cost Price). The system shall generate a Low-Stock Report listing all items below their threshold. The system shall generate a Top-Selling Products report. The system shall allow exporting reports to PDF or CSV format.
 Non-functional Requirements
Performance : The dashboard shall load within 3 seconds on standard broadband connections. Searching for a product during a sale shall return results instantly. Generating reports for a 6-month period shall complete within 5 seconds.
Security : All data transmission shall use HTTPS encryption. User passwords shall be hashed using industry-standard algorithms. Authentication tokens shall expire after a configurable period. API endpoints shall be protected against common vulnerabilities (SQL injection, XSS).
Usability : The interface shall be intuitive enough for users with no technical background. The sales interface shall be optimized for speed, requiring minimal clicks. All error messages shall be clear and actionable. The application shall provide visual feedback for all user actions (e.g., "Sale Saved Successfully").
Reliability : The system shall maintain 99% uptime during business hours. Data shall be backed up regularly. Transaction data (sales, stock updates) shall never be lost due to system failures.
 
Scalability
The architecture shall support horizontal scaling for increased load as the business grows. Database design shall accommodate growth in products and sales records.
Compatibility
The application shall function on modern browsers (Chrome, Firefox, Safari). The interface shall be responsive for use on tablets, a common form factor in shops.
 System Architecture
High-Level Architecture
Stock Wise follows a modern three-tier architecture consisting of a Presentation Layer, Application Layer, and Data Layer.
CLIENT LAYER
    |
    | React Frontend
    |
    | Dashboard | Products | Sales | Suppliers | Reports
    |   Module  |  Module  | Module|  Module   | Module
    |___________|__________|_______|___________|_________
            |
            | Auth
            | (Clerk)
            |
            ▼







APPLICATION LAYER
    |
    | API Gateway
    |
    | Product | Sales  | Supplier | Report |
    | Service | Service| Service  | Service
 |_________|________|__________|________|
            |            |
            |            |
    _________|____________|_______________
    |                                    |
DATA LAYER                           AUTH SERVICE
    |                                    |
Database                            Clerk
(Products, Sales, Suppliers ,Users ) .
Component Description
React Frontend: Single-page application built with React, providing a responsive and interactive user interface optimized for quick data entry.
API Gateway: Central entry point for all client requests. Handles routing and request validation.
Product Service: Manages all CRUD operations for products and inventory levels. Handles low-stock alerts.
Sales Service: Manages the creation of sales, updates inventory levels, and calculates totals and taxes.
Supplier Service: Manages supplier information and links them to products.
Report Service: Generates various business reports by aggregating data from sales and products.
Database: Persistent storage for user data, products, sales transactions, and supplier information.
Clerk: Third-party authentication service handling user registration and login.

Design Diagrams

 Use Case Diagram


      STOCKWISE SYSTEM
        ┌─────────────────┐
        │   SHOP OWNER    │
        └─────────────────┘
                |
                | (Interacts with)
                |
    ┌───────────┼───────────┐
    │           |           |
    ▼           ▼           ▼
┌─────────┐ ┌─────────┐ ┌─────────┐
│ Manage  │ │ Process │ │ Generate│
│Products │ │  Sale   │ │ Reports │
└─────────┘ └─────────┘ └─────────┘
    |           |           |
    Manages     Records     Views
    Inventory   Sales       Business
                            Insights

 
Workflow Diagram - Sales Process
START
  |
User Opens (Sales Page)
    
User Searches/Selects Product
  |
 User Adds Product to Cart (with Qty)
  |
  System Calculates Running Total
  |
  [Repeat for more products]
  |
  User Clicks "Complete Sale"
  |
  System Updates Stock Levels
  |
System Saves Sale Record
  |
System Generates Printable Bill
  |
  END
 

Design Decisions & Rationale
Technology Stack Selection
React for Frontend: Chosen for its component-based architecture, allowing for reusable UI components like product cards and sales rows. This ensures a consistent and maintainable interface.
Node.js for Backend: Selected for its efficiency with I/O-heavy operations and a vast ecosystem of libraries, allowing for rapid development of the API services.
SQL Database (PostgreSQL): A relational database is ideal for structured data like products, sales, and suppliers. It ensures data integrity with transactions (e.g., when a sale is made, both the sales and sale_items tables are updated atomically).
User Interface Decisions
Dashboard-First Design: The application opens to the dashboard to give the retailer an immediate overview of the day's key metrics (sales, low-stock items).
Speed-Optimized Sales Page: The sales interface is designed for minimal clicks, with a prominent search bar and quick-add buttons to serve customers quickly during peak hours.
Color-Coded Alerts: Low-stock items are highlighted in orange or red throughout the application, making critical issues immediately visible.
Card-Based Layout: Information on the dashboard is organized into cards (Today's Sales, Top Products, etc.) for clear visual separation and easy scanning.

 Data Architecture Decisions
Separate Sale and Sale_Items Tables: This normalizes the data, allowing a single sale to contain multiple products. This is essential for accurate reporting and tracking.
Storing Prices in Sales Record: The sale_items table stores the unit_price at the time of sale. This ensures historical sales and profit reports remain accurate even if the product's selling price is changed later.
Integer for Currency: All monetary values (cost_price, selling_price) are stored as integers representing paise (e.g., ₹50.00 is stored as 5000) to prevent floating-point rounding errors.
 
Implementation Details

Dashboard Implementation
The dashboard component fetches summary data from various API endpoints on load. The "Today's Sales" total is calculated by summing the total amount of all sales with today's date. The "Low Stock Count" is determined by counting products where stock quantity  <=  Low Stock alert. The "Top Products" list is generated by querying the sale items table for the week, grouped by product.

Sales Management Implementation
The sales process is implemented as a multi-step flow on the frontend. When a product is added, it's held in a local state (the "cart"). The running total is recalculated with each change. Upon completion, a single API call is made to POST /api/sales which contains the sale header and an array of line items. The backend service, within a database transaction, creates the sale record, inserts the line items, and updates the stock quantity for each product involved. 

Inventory Management Implementation
Stock levels are primarily updated automatically via the sales process. A separate endpoint PATCH /api/products/:id/stock allows for manual adjustments (e.g., for receiving new stock from a supplier or writing off damaged goods). A background job runs periodically to check all products and update a is low stock flag, which is used for the dashboard alert
.
Reporting Implementation
Reports are generated by the Report Service. For example, the Profit & Loss report for a date range involves:
1. Fetching all sales in that period.
2. For each sale item, calculating the profit as (sale unit price – product cost price) * quantity.
3. Aggregating the total revenue and total profit
 
Screenshots / Results

Dashboard View
The main dashboard displays summary cards at the top showing Today's Sales (₹8,450), Month-to-Date Sales (₹1,52,800), and Low Stock Items (3). A Daily Sales bar chart shows trends for the past 7 days. A Top Selling Products list shows "Colgate Toothpaste (120g)" at the top with 45 units sold this week. A Recent Sales table shows the last 5 transactions.

Products View
The products page shows a list of items in a table. Columns include Product Name, SKU, Current Stock, Cost Price, and Selling Price. A row for "Aashirvad Atta (10kg)" is highlighted in orange, with a stock level of 5, indicating it's below its set threshold of 10. Buttons for Edit, Delete, and Add New Product are clearly visible.

 Sales View
The sales interface shows a clean layout with a large search bar at the top. As the user types " Colg  ", a dropdown suggests "Colgate Toothpaste (120g)". Upon selection, the item is added to the cart below, which displays columns for Product, Quantity, Unit Price, and Total. The quantity can be increased. The Grand Total at the bottom updates in real-time to ₹66. A prominent "Complete Sale" button is present.

 Reports View
The reports page has dropdowns to select a report type (e.g., "Profit & Loss") and a date range (e.g., "Last 30 Days"). Upon generating, the report shows: Total Revenue: ₹1,52,800, Total Cost of Goods Sold: ₹1,10,000, and Net Profit: ₹42,800. An Export as PDF button is available.

 Testing Approach
Unit Testing
Unit tests were written for core calculation functions(profit calculation, stock level updates, tax application) and utility functions (formatters, validators).

Integration Testing
Integration tests covered critical flows like :creating a product, then selling it, and verifying that the stock level decreased correctly and the sale appears in the report.

User Acceptance Testing (UAT)
UAT was conducted with a local kirana(grocery) store owner .Feedback was collected on the sales interface speed, clarity of the low-stock alerts, and the usefulness of the Profit & Loss report.
Challenges Faced

Real-Time Stock Update Integrity
Challenge :Ensuring that simultaneous sales of the same product (a rare but possible scenario) do not cause a "race condition" where stock levels become incorrect.
Solution: Implemented database transactions and "pessimistic locking" during the sale process to ensure that stock updates are atomic and sequential.

 Performance with Large Product Lists
Challenge  :The product search during sales needed to be instantaneous, even with a catalog of several thousand products.
Solution:I implemented client-side debouncing on the search input and used efficient database indexing on the product name and  columns.

Learnings & Key Takeaways

 Technical Learnings
Database Transactions are Critical :For financial and inventory data, using transactions is non-negotiable to maintain data integrity.
UI/UX for Speed :For business software, especially used in customer-facing scenarios, UI speed and efficiency are as important as features.

Domain Learnings
Understanding Retail Workflows :Spending time with retailers to understand their daily routine (peak hours, common operations) was invaluable in designing the right user flows.
The Value of Simplicity :The most successful feature was the simple low-stock alert. Solving a single, painful problem effectively can provide immense value.
Future Enhancements

Short-Term Enhancements
Barcode Scanning :Use a device's camera to scan product barcodes for quick addition during sales and stock intake.
Purchase Orders :Create and track purchase orders sent to suppliers.
Medium-Term Enhancements
Mobile App :A dedicated mobile app for on-the-go stock checks and sales.
Customer Management: Track customer purchases and offer loyalty points.
Long-Term Enhancements
Multi-Shop Support :Allow a single owner to manage multiple store locations.
Predictive Analytics :Use ML to forecast demand and suggest optimal reorder quantities.

References

Technical Documentation
React Documentation- https://react.dev/
Node.js Documentation- https://nodejs.org/en/docs/
PostgreSQL Documentation- https://www.postgresql.org/docs/

 Domain References
GST India Portal- https://www.gst.gov.in/
Basics of Inventory Management- https://www.investopedia.com/terms/i/inventory-management.asp
